/*
____/\\\\\\\\\_____        __/\\\________/\\\_        __/\\\\\\\\\\\_
 __/\\\///////\\\___        _\/\\\_______\/\\\_        _\/////\\\///__
  _\/\\\_____\/\\\___        _\/\\\_______\/\\\_        _____\/\\\_____
   _\/\\\\\\\\\\\/____        _\/\\\_______\/\\\_        _____\/\\\_____
    _\/\\\//////\\\____        _\/\\\_______\/\\\_        _____\/\\\_____
     _\/\\\____\//\\\___        _\/\\\_______\/\\\_        _____\/\\\_____
      _\/\\\_____\//\\\__        _\//\\\______/\\\__        _____\/\\\_____
       _\/\\\______\//\\\_        __\///\\\\\\\\\/___        __/\\\\\\\\\\\_
        _\///________\///__        ____\/////////_____        _\///////////__
*/
#ifndef RUI_DEFINE_H
#define RUI_DEFINE_H
#include "main.h"
#include "tim.h"
/************************************************************万能分隔符**************************************************************
 * 	@author:			//小瑞
 *	@performance:	//开发模式下的宏定义
 *	@parameter:		//
 *	@time:				//23-04-13 20:15
 *	@ReadMe:			//
 ************************************************************万能分隔符**************************************************************/
#ifdef RUI_DF_DEVELOPMENT
//主板通电后，多久开始检测电机
#define RUI_DF_MOTOR_START_TIME 5000
#endif
/************************************************************万能分隔符**************************************************************
 * 	@author:			//小瑞
 *	@performance: //宏定义
 *	@parameter:	  //
 *	@time:				//23-03-28 21:19
 *	@ReadMe:			//
 ************************************************************万能分隔符**************************************************************/
//INIT成功
#define RUI_DF_READY 1
//INIT错误
#define RUI_DF_ERROR 0

#define RUI_DF_NOW  1
#define RUI_DF_LAST 0

//PID双环
#define RUI_DF_PID_DOUBLE 1
//PID单环
#define RUI_DF_PID_SINGLE 0
//正在判断主控位置
#define RUI_DF_MASTER_LOCATION_JUDGEING 0
//主控位置判断完成，在头部
#define RUI_DF_MASTER_LOCATION_HEAD 1
//主控位置判断完成，在底盘
#define RUI_DF_MASTER_LOCATION_BOTTOM 2
//模式切换后等待的时间
#define RUI_DF_CHANGE_TIME 200
/************************************************************万能分隔符**************************************************************
 * 	@author:			//小瑞
 *	@performance:	//LED
 *	@parameter:		//
 *	@time:				//23-04-13 15:57
 *	@ReadMe:			//
 ************************************************************万能分隔符**************************************************************/
#define RUI_DF_LED_RED    0
#define RUI_DF_LED_GREEN  1
#define RUI_DF_LED_BLUE   2
#define RUI_DF_LED_YELLOW 3
#define RUI_DF_LED_PURPLE 4
#define RUI_DF_LED_CYAN   5
/************************************************************万能分隔符**************************************************************
 * 	@author:			//小瑞
 *	@performance:	    //离线检测宏定义
 *	@parameter:		    //
 *	@time:				//23-03-28 20:13
 *	@ReadMe:			//
 ************************************************************万能分隔符**************************************************************/
//设备离线
#define RUI_DF_OFFLINE 0
//设备在线
#define RUI_DF_ONLINE  1 
//遥控器离线检测时间
#define RUI_DF_DBUS_OFFLINE_TIME 15  
//电机离线检测时间
#define RUI_DF_MOTOR_OFFLINE_TIME 15
//主控位置判断时间 
#define RUI_DF_MASTER_LOCATION_JUDGE_TIME 100
/************************************************************万能分隔符**************************************************************
 * 	@author:			//小瑞
 *	@performance:	    //底盘电机ID宏定义
 *	@parameter:		    //
 *	@time:				//23-03-28 20:13
 *	@ReadMe:			//    车头
                            ↑  ||  ↑
                            2→ || ←1
                            ————————
                            3→ || ←4
                            ↓  ||  ↓
                              车尾
 ************************************************************万能分隔符**************************************************************/
//从机CAN1
#define RUI_DF_MOTOR_BOTTOM_3508_1_ID 0x201
#define RUI_DF_MOTOR_BOTTOM_3508_2_ID 0x202
#define RUI_DF_MOTOR_BOTTOM_3508_3_ID 0x203
#define RUI_DF_MOTOR_BOTTOM_3508_4_ID 0x204

/************************************************************万能分隔符**************************************************************
 * 	@author:			//王涵炜
 *	@performance:	    //转矿电机ID宏定义
 *	@parameter:		    //
 *	@time:				//23-04-14 15:55
 *	@ReadMe:			//
 ************************************************************万能分隔符**************************************************************/
//从机CAN2
#define RUI_DF_MOTOR_BOTTOM_2006_1_ID 0x201
#define RUI_DF_MOTOR_BOTTOM_2006_2_ID 0x202
#define RUI_DF_MOTOR_BOTTOM_2006_3_ID 0x203
#define RUI_DF_MOTOR_BOTTOM_2006_4_ID 0x204

/************************************************************万能分隔符**************************************************************
 * 	@author:			//小瑞
 *	@performance:	    //电机PID参数宏定义
 *	@parameter:		    //
 *	@time:				//23-03-29 18:18
 *	@ReadMe:			//
 *************************************************************万能分隔符**************************************************************/
//底盘单速度环PID参数                            P   I    D    maxI  maxOut
//2023-05-07 17:12 底盘PID OK
#define RUI_DF_PID_DATA_BOTTOM_3508_SPEED  {    15, 9.0f, 0, 16000, 16000         }
//2023-05-27 17:49 | 电流环 防超功率
#define RUI_DF_PID_DATA_BOTTOM_3508_CURENT {    1,  0.0f, 0, 3000,  16000         }

#define RUI_DF_PID_DATA_BOTTOM_2006_SPEED  {    2,  0.0f, 0, 1000,  16000         }

#endif